read_verilog -sv -formal -overwrite {workspace}/block.v
design -reset-vlog; proc;
write_json {workspace}/netlist/block.json